GeFengthe/RTL8762/src/app/mesh/ali_strip/main_app.c
/**
*********************************************************************************************************
*               Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      main_app.c
* @brief     Smart mesh demo application
* @details
* @author    bill  astor
* @date      2019-04-26
* @version   v1.0
* *********************************************************************************************************
*/

#include <string.h>
#include <stdio.h>
#include <app_msg.h>
#include <trace.h>
#include <gap_scan.h>
#include <gap.h>
#include <gap_msg.h>
#include <gap_adv.h>
#include <gap_bond_le.h>
#include <profile_server.h>

#include "rtl876x.h"
#include "trace.h"
#include "gap_wrapper.h"
#include "mesh_api.h"
#include "main_app.h"
#include "light_effect_app.h"
#include "sha256.h"
#include "dfu_server.h"
#include "dfu_client.h"
#include "ais.h"
#include "mp_cmd_parse.h"
#include "user_data.h"
#include "otp_config.h"
#include "mem_config.h"
#include "light_swtimer.h"
#include "light_ctl_server_app.h"
#include "strip_app.h"
#include "light_cwrgb_app.h"

#include "strip_timer.h"
#include "system_clock.h"
#if ALI_AIS_SUPPORT
#include "ais.h"
#include "dis.h"
T_SERVER_ID dis_server_id;
#endif

/**
 * @brief  Application Link control block defination.
 */
typedef struct
{
    T_GAP_CONN_STATE        conn_state;          /**< Connection state. */
    T_GAP_REMOTE_ADDR_TYPE  bd_type;             /**< remote BD type*/
    uint8_t                 bd_addr[GAP_BD_ADDR_LEN]; /**< remote BD */
} T_APP_LINK;

T_GAP_DEV_STATE gap_dev_state = {0, 0, 0, 0};                 /**< GAP device state */
T_APP_LINK app_link_table[APP_MAX_LINKS];
static timer_data_t temp;
timer_data_t *pTimer_adjust = &temp;
uint8_t weekday_list[] = {MON, TUE, WED, THU, FRI, SAT, SUN};
uint8_t retry_times = 0;
uint8_t retry_period = 0;

void app_handle_gap_msg(T_IO_MSG *p_gap_msg);

void timer_data_init(void)
{
    temp.index = 0xFF;
    temp.unix_time = 0xFFFFFFFF;
    temp.on_off = GENERIC_OFF;
}

/**
 * @brief    All the application messages are pre-handled in this function
 * @note     All the IO MSGs are sent to this function, then the event handling
 *           function shall be called according to the MSG type.
 * @param[in] io_msg  IO message data
 * @return   void
 */
void app_handle_io_msg(T_IO_MSG io_msg)
{
    uint16_t msg_type = io_msg.type;
    switch (msg_type)
    {
    case IO_MSG_TYPE_BT_STATUS:
        app_handle_gap_msg(&io_msg);
        break;
    case DFU_SERVER_TIMEOUT_MSG:
        dfu_server_adv_send();
        break;
    case AIS_SERVER_TIMEOUT_MSG:
        ais_server_timeout_handle(io_msg.u.buf);
        break;
    case IO_MSG_TYPE_UART:
        {
            /* We handle user command informations from Data UART in this branch. */
            uint8_t data = io_msg.subtype;
            mp_cmd_parse(&data, sizeof(data));
        }
        break;
    case IO_MSG_TYPE_RTC:
        switch (io_msg.subtype)
        {
        case IO_MSG_TIMER_ALARM:
            pTimer_adjust = (timer_data_t *)io_msg.u.buf;
            DBG_DIRECT("set timer to %x, current time is %x", pTimer_adjust->unix_time,
                       strip_data_current.unix_time);
            timer_data_init();
            break;

        case IO_MSG_TIMER_RWS:
            // All timers are handled in this branch, which can be replaced by customized codes

            //Local time:
            local_time.minutes++;
            if (local_time.minutes == 60)
            {
                local_time.minutes = 0;
                local_time.hour++;
                if (local_time.hour == 24)
                {
                    local_time.hour = 0;
                    local_time.weekday = (local_time.weekday + 1) % 7;
                }
            }
            strip_data_current.unix_time += 60;
            DBG_DIRECT("local_time: %2d/%2d/%2d day%d %2d : %2d", local_time.year, local_time.month,
                       local_time.day, local_time.weekday + 1,
                       local_time.hour, local_time.minutes);

            //Update system time
            if (strip_data_current.has_updated == false)
            {
                if (strip_data_current.need_retry)
                {
                    retry_period++;
                    if (retry_period == strip_data_current.time_sync_retry_delay)
                    {
                        if (retry_times <= strip_data_current.time_sync_retry_times)
                        {
                            send_update_request();
                            retry_times++;
                        }
                        else
                        {
                            //report error here
                            strip_data_current.has_updated = true;
                        }
                    }
                }
                else
                {
                    if ((strip_data_current.unix_time - sys_clk_update) == MINUTE * strip_data_current.time_sync_period)
                    {
                        send_update_request();
                        strip_data_current.need_retry = true;
                    }
                }
            }
            else
            {
                retry_period = 0;
                retry_times = 0;
                strip_data_current.has_updated = false;
                strip_data_current.need_retry = false;
            }
            //Execute timing switch, publish state and delete finished timer
            //Execute if periodic timer exists
            for (int i = 0; i < TIMER_MAXIMUM; i++)
            {
                if (period_list[i].schedule == 0)
                {
                    break;
                }
                if (weekday_list[local_time.weekday] & period_list[i].schedule)
                {
                    if ((local_time.minutes + local_time.hour * 60) == period_list[i].relative_time)
                    {
                        strip_data_current.strip_on_off = period_list[i].on_off ? GENERIC_ON : GENERIC_OFF;
                        T_IO_MSG on_off_msg;
                        on_off_msg.type = IO_MSG_TYPE_GPIO;
                        on_off_msg.subtype = strip_data_current.strip_on_off;
                        app_send_msg_to_apptask(&on_off_msg);
                        clear_period(i);
                        break;
                    }
                }
            }

            if (strip_data_current.unix_time >= timer_list[0].unix_time)
            {
                strip_data_current.strip_on_off = timer_list[0].on_off ? GENERIC_ON : GENERIC_OFF;
                T_IO_MSG on_off_msg;
                on_off_msg.type = IO_MSG_TYPE_GPIO;
                on_off_msg.subtype = timer_list[0].on_off ? GENERIC_ON : GENERIC_OFF;
                app_send_msg_to_apptask(&on_off_msg);
                clear_timer(timer_list[0].index);

                timer_sort();
            }
            break;
        default:
            break;
        }
        break;
#if (ROM_WATCH_DOG_ENABLE == 1)
    case IO_MSG_TYPE_RESET_WDG_TIMER:
        {
            APP_PRINT_INFO0("[WDG] Watch Dog Rset Timer");
            WDG_Restart();
        }
        break;
#endif
    case IO_MSG_TYPE_TIMER:
        light_handle_sw_timer_msg(&io_msg);
        break;
    case IO_MSG_TYPE_GPIO:
        switch (io_msg.subtype)
        {
        case GENERIC_ON:
            //TODO: open power strip here
            light_rgb_turn_on();
            light_cwrgb_turn_on();
            handle_pub_evt(io_msg.subtype);
            break;
        case GENERIC_OFF:
            //TODO: shut down power strip here
            light_rgb_turn_off();
            light_cwrgb_turn_off();
            handle_pub_evt(io_msg.subtype);
            break;
        default:
            break;
        }
        break;
    default:
        break;
    }

